Homework22.1/report_hm22/statistics.json
{
  "Create new character" : {
    "transaction" : "Create new character",
    "sampleCount" : 100250,
    "errorCount" : 51167,
    "errorPct" : 51.039402,
    "meanResTime" : 1.7001995012468878,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1414.9611856033875,
    "receivedKBytesPerSec" : 1812.8262421709599,
    "sentKBytesPerSec" : 153.5728541813691
  },
  "Delete character" : {
    "transaction" : "Delete character",
    "sampleCount" : 100231,
    "errorCount" : 51152,
    "errorPct" : 51.03411,
    "meanResTime" : 1.7030459638235564,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1418.7781332276422,
    "receivedKBytesPerSec" : 1823.2278250670597,
    "sentKBytesPerSec" : 123.51695093317385
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 501279,
    "errorCount" : 255875,
    "errorPct" : 51.04443,
    "meanResTime" : 1.9509095733114328,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 7073.817453149695,
    "receivedKBytesPerSec" : 9658.194098577027,
    "sentKBytesPerSec" : 648.7508615755179
  },
  "Get all characters" : {
    "transaction" : "Get all characters",
    "sampleCount" : 100298,
    "errorCount" : 51203,
    "errorPct" : 51.05087,
    "meanResTime" : 2.863347225268715,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1415.3589975163693,
    "receivedKBytesPerSec" : 2420.216563593644,
    "sentKBytesPerSec" : 106.89779123567678
  },
  "Update character" : {
    "transaction" : "Update character",
    "sampleCount" : 100240,
    "errorCount" : 51159,
    "errorPct" : 51.03651,
    "meanResTime" : 1.6904828411811506,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1418.885444534092,
    "receivedKBytesPerSec" : 1814.0461030059662,
    "sentKBytesPerSec" : 158.11934302323522
  },
  "Get character by id" : {
    "transaction" : "Get character by id",
    "sampleCount" : 100260,
    "errorCount" : 51194,
    "errorPct" : 51.06124,
    "meanResTime" : 1.7969778575703261,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 50.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1415.062383560097,
    "receivedKBytesPerSec" : 1799.7040706331506,
    "sentKBytesPerSec" : 107.55664646904815
  }
}